src/test/resources/entries/subscription-entries.xml

<?xml version="1.0" encoding="UTF-8"?>
<dataset>
    <services id="1"
              created_by_user="createdByUser"
              creation_time="2014-12-24 11:13:28"
              modified_by_user="modifiedByUser"
              modification_time="2014-12-25 11:13:28"
              name="item1"
              description="description"
              is_continuous="true"
              length="DAY"
              currency="USD"
              amount="10.46"/>
    <services id="2"
              created_by_user="createdByUser"
              creation_time="2014-12-24 11:13:28"
              modified_by_user="modifiedByUser"
              modification_time="2014-12-25 11:13:28"
              name="item2"
              description="description"
              is_continuous="true"
              length="DAY"
              currency="EUR"
              amount="12.00"/>
    <subscriptions id="1"
                   created_by_user="createdByUser"
                   creation_time="2014-12-24 11:13:28"
                   modified_by_user="modifiedByUser"
                   modification_time="2014-12-25 11:13:28"
                   service_id="1"
                   client="user1@gmail.com"
                   start_date="2016-03-13 11:13:28"
                   end_date="2016-03-13 11:13:28"
                   state="EXPIRED"
                   is_auto="false"/>
    <subscriptions id="2"
                   created_by_user="createdByUser"
                   creation_time="2014-12-24 11:13:28"
                   modified_by_user="modifiedByUser"
                   modification_time="2014-12-25 11:13:28"
                   service_id="2"
                   client="user1@gmail.com"
                   start_date="2016-03-14 15:13:28"
                   end_date="2016-03-15 15:13:28"
                   state="ACTIVE"
                   is_auto="false"/>
</dataset>